Reports/Календарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>Календарь</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Команда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоДниРождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/Календарь/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДатыУстановить()
	Отчет.Период.Вариант	= ВариантСтандартногоПериода.ДоКонцаЭтогоМесяца;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСегодня(Команда)
	ДатыУстановить();
	КомандаОбновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Игрок = Параметр Тогда
		Игрок = Неопределено;
		ИзображениеУстановить(Элементы.Список.ТекущиеДанные.ИгрокИлиМатч, Игрок, Изображение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭлементПриИзменении(Элемент)
	КомандаОбновить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзображениеДефолт	= ИзображениеДефолтПолучить();
	
	Если НЕ ЗначениеЗаполнено(Отчет.Период) Тогда
		ДатыУстановить();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Отчет.Команда) Тогда
		Отчет.Команда		= МояКоманда();
	КонецЕсли;
	КомандаОбновить();
КонецПроцедуры

&НаСервере
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервереБезКонтекста
Процедура ИзображениеУстановить(ИгрокИлиМатч, Игрок, Изображение)
	Если ИгрокИлиМатч = Игрок Тогда
		//
	Иначе
		Если ИгрокИлиМатч.Изображение.Получить() = Неопределено Тогда
			Изображение	= ИзображениеДефолтПолучить();
		Иначе
			Изображение	= ПолучитьНавигационнуюСсылку(ИгрокИлиМатч, "Изображение");
		КонецЕсли;
		Игрок	= ИгрокИлиМатч;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзображениеДефолтПолучить()
	Возврат СерверныйФункции.ИзображениеДефолтПолучить();
КонецФункции

&НаСервереБезКонтекста
Функция Вчера()
	Возврат (НачалоДня(ТекущаяДатаСеанса()) - 1);
КонецФункции

&НаКлиенте
Процедура КомандаОбновить(Команда=Неопределено)
	Элементы.Период.Подсказка	= Строка(Отчет.Период);
	
	Список.Параметры.УстановитьЗначениеПараметра("Команда",				Отчет.Команда);
	Список.Параметры.УстановитьЗначениеПараметра("Дата",				Вчера());
	Список.Параметры.УстановитьЗначениеПараметра("ДатаН",				Отчет.Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаК",				Отчет.Период.ДатаОкончания);
	Список.Параметры.УстановитьЗначениеПараметра("ММДД1",				Месяц(Отчет.Период.ДатаНачала) * 100 + День(Отчет.Период.ДатаНачала));
	Список.Параметры.УстановитьЗначениеПараметра("ММДД2",				Месяц(Отчет.Период.ДатаОкончания) * 100 + День(Отчет.Период.ДатаОкончания));
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоДниРождения",	Отчет.ТолькоДниРождения);
	//Элементы.Список.Обновить();
	СписокПриАктивизацииСтроки();
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Элемент.ТекущиеДанные.ИгрокИлиМатч);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент=Неопределено)
	Если Элемент = Неопределено Тогда
		Игрок		= Неопределено;
		Изображение	= ИзображениеДефолт;
	ИначеЕсли Элемент.ТекущиеДанные = Неопределено Тогда
		Игрок		= Неопределено;
		Изображение	= ИзображениеДефолт;
	ИначеЕсли Элемент.ТекущиеДанные.ЭтоИгрок Тогда
		ИзображениеУстановить(Элемент.ТекущиеДанные.ИгрокИлиМатч, Игрок, Изображение);
	ИначеЕсли Изображение <> ИзображениеДефолт Тогда
		Игрок		= Неопределено;
		Изображение	= ИзображениеДефолт;
	КонецЕсли;
КонецПроцедуры
